#pragma once
#include <string>

#define DEFAULT "\033[0m" // - все атрибуты по умолчанию;

#define BLACK "\033[30"; // - черный цвет знаков;
#define RED "\033[31"; // - красный цвет знаков;
#define GREEN "\033[32"; // - зеленый цвет знаков;
#define BLUE "\033[34"; // - синий цвет знаков;
#define WHITE "\033[37"; // - серый цвет знаков;
#define YELLOW "\033[33"; // - коричневый цвет знаков;
#define PINK "\033[35"; // - фиолетовый цвет знаков;
#define TURQUOISE "\033[36"; // - цвет морской волны знаков;

#define BLACK_BG "\033[40"; // - черный цвет фона;
#define RED_BG "\033[41"; // - красный цвет фона;
#define GREEN_BG "\033[42"; // - зеленый цвет фона;
#define BLUE_BG "\033[44"; // - синий цвет фона;
#define WHITE_BG "\033[47"; // - серый цвет фона.
#define YELLOW_BG "\033[43"; // - коричневый цвет фона;
#define PINK_BG "\033[45"; // - фиолетовый цвет фона;
#define TURQUOISE_BG "\033[46"; // - цвет морской волны фона;